#+TITLE: rss2email 使用说明
* 安装rss2email的依赖
Debian 7 软件库中的html2test和feedparser版本太低，可以使用easy_install手动安装这两个python包。

#+BEGIN_SRC shell :results output scala
sudo apt-get install python-setuptools
sudo apt-get install python3-setuptools
#+END_SRC

#+RESULTS:
#+begin_example
正在读取软件包列表...
正在分析软件包的依赖关系树...
正在读取状态信息...
python-setuptools 已经是最新的版本了。
升级了 0 个软件包，新安装了 0 个软件包，要卸载 0 个软件包，有 0 个软件包未被升级。
正在读取软件包列表...
正在分析软件包的依赖关系树...
正在读取状态信息...
python3-setuptools 已经是最新的版本了。
升级了 0 个软件包，新安装了 0 个软件包，要卸载 0 个软件包，有 0 个软件包未被升级。
#+end_example


rss2email使用python3，所以使用easy_install3安装python包。

#+BEGIN_SRC shell :results output scala
sudo easy_install3 html2text
sudo easy_install3 feedparser
#+END_SRC

#+RESULTS:
#+begin_example
Searching for html2text
Best match: html2text 3.200.3
Processing html2text-3.200.3-py3.2.egg
html2text 3.200.3 is already the active version in easy-install.pth
Installing html2text script to /usr/local/bin

Using /usr/local/lib/python3.2/dist-packages/html2text-3.200.3-py3.2.egg
Processing dependencies for html2text
Finished processing dependencies for html2text
Searching for feedparser
Best match: feedparser 5.1.3
Processing feedparser-5.1.3-py3.2.egg
feedparser 5.1.3 is already the active version in easy-install.pth

Using /usr/local/lib/python3.2/dist-packages/feedparser-5.1.3-py3.2.egg
Processing dependencies for feedparser
Finished processing dependencies for feedparser
#+end_example

* 安装rss2email
** 下载源代码
#+BEGIN_SRC shell :eval never
cd ~/project
git clone https://github.com/wking/rss2email.git
#+END_SRC

** 更新源代码
#+BEGIN_SRC shell :results output scala
cd ~/project/rss2email
git pull
#+END_SRC

#+RESULTS:
: Already up-to-date.

** 安装
#+BEGIN_SRC shell :results output scala
cd ~/project/rss2email
sudo python3 setup.py install
#+END_SRC

#+RESULTS:
#+begin_example
running install
running build
running build_py
running build_scripts
running install_lib
running install_scripts
changing mode of /usr/local/bin/r2e to 755
running install_egg_info
Removing /usr/local/lib/python3.2/dist-packages/rss2email-3.9.egg-info
Writing /usr/local/lib/python3.2/dist-packages/rss2email-3.9.egg-info
#+end_example

* 安装rss2email_post_hooks包
将rss2email_post_hooks所在的目录添加到PYTHONPATH（语法与shell里面的PATH一样）

最简单的方式就是：将下面一行代码写入~/.bashrc文件。
#+BEGIN_SRC shell :eval never
export PYTHONPATH=$PYTHONPATH:~/project/emacs-packages/emacs-helper/other/rss2email-template/
#+END_SRC

测试rss2email_post_hooks包

#+BEGIN_SRC shell
bash ./test.sh
#+END_SRC

#+RESULTS:

* 配置
拷贝模板到指定位置，然后编辑。
#+BEGIN_SRC shell :eval never
mv ~/.config/rss2email.cfg ~/.config/rss2email.cfg-backup`date +%Y%m%d%H%M`
cp rss2email.cfg ~/.config/rss2email.cfg
#+END_SRC
